# Install Homebrew taps.
# Bundle: Used for installing dependencies from ~/.Brewfile.
# Cask: Used to install macOS applications distributed as binaries.
# Cask-Versions: Used to install alternate versions of Casks.
# Core: Used to install CLI applications.
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Install Bash 4.
# Note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before
# running `chsh`. This is done in the brew_installed_bash function in brew.sh.
brew "bash"
brew "bash-completion@2"

# Install GNU File, Shell, and Text utilities.
brew "coreutils"

# Install mas - a simple command line interface for the Mac App Store.
brew "mas"

# Install other useful binaries.
brew "git"
brew "rbenv"
brew "wget"

# Install macOS applications distributed as binaries.
cask "atom"
cask "dropbox"
cask "firefox"
cask "gimp"
cask "google-chrome"
cask "gpg-suite"
cask "intellij-idea-ce"
cask "qbittorrent"
cask "sourcetree"
cask "spotify"
cask "torbrowser"
cask "tunnelblick"
cask "virtualbox"
cask "vlc"

# Install applications from the Mac App Store.
mas "1Password 7", id: 1333542190
mas "Airmail 3", id: 918858936
mas "Magnet", id: 441258766
mas "Reeder", id: 880001334
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
