# Install Homebrew taps.
# Bundle: Used for installing dependencies from ~/.Brewfile.
# Cask: Used to install macOS applications distributed as binaries.
# Cask-Versions: Used to install alternate versions of Casks.
# Core: Used to install CLI applications.
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Install mas - a command line interface for installing Mac App Store apps.
brew "mas"

# Install GNU File, Shell, and Text utilities.
# I then use bash aliases to use the GNU utilities rather than the BSD variants.
brew "coreutils"

# Useful packages.
brew "git"
brew "pyenv"
brew "rbenv"
brew "shellcheck"
brew "wget"

# Bitcoin/altcoin development.
brew "automake"
brew "berkeley-db4"
brew "boost"
brew "help2man"
brew "libevent"
brew "librsvg"
brew "libtool"
brew "miniupnpc"
brew "openssl"
brew "pkg-config"
brew "protobuf"
brew "qrencode"
brew "qt"

# Web Development.
brew "node@10"

# Install macOS applications distributed as binaries.
cask "adobe-creative-cloud"
cask "cleanmymac"
cask "discord"
cask "dropbox"
cask "firefox"
cask "gimp"
cask "google-chrome"
cask "gpg-suite"
cask "imageoptim"
cask "keepingyouawake"
cask "ledger-live"
cask "plex-media-player"
cask "qbittorrent"
cask "riot"
cask "sdformatter"
cask "skype"
cask "sourcetree"
cask "spotify"
cask "steam"
cask "tor-browser"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"

# Install applications from the Mac App Store.
mas "1Password 7", id: 1333542190
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Reeder", id: 880001334
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
